---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.OwnElementsOutOfDate
source: html/dffec138-edf3-2903-ca7c-cb6d9a875d0d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.OwnElementsOutOfDate Property

You now own the element, but your file is out of date. You must Reload Latest before editing the element.

## Syntax (C#)
```csharp
public static FailureDefinitionId OwnElementsOutOfDate { get; }
```